{
  "status": "ativa",
  "nome": "rubrica_sinapse_ia",
  "versao": "v1.4",
  "base": "SAEB 2017 + PISA 2022",
  "modelo": "LLAMA3 + análise pedagógica",
  "timestamp": {
    "$date": "2025-06-07T14:00:00Z"
  },
  "autor": "neirivon",
  "origem": "Rubrica base utilizada para triangulação com dados SAEB/PISA e validação por IA",
  "justificativa": "Estrutura original da versão 1.4 mantida como referência primária após análise crítica qualitativa e validação automatizada.",
  "dimensoes": [
    {
      "dimensao": "Progressão Cognitiva Educacional",
      "fonte": "Adaptado de Anderson e Krathwohl (2001), com base em Bloom (1956).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "Taxonomia de Bloom"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Identifica informações simples e repete dados básicos relacionados à realidade local, como nomes de fenômenos naturais ou práticas cotidianas observadas em sua região."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Compreende conceitos fundamentais e os aplica, com apoio, a situações observadas em seu município, como reconhecer práticas sustentáveis ou interpretar dados simples sobre o ambiente local."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Analisa informações do seu território, relaciona diferentes fatores (sociais, ambientais, econômicos) e propõe explicações fundamentadas para problemas ou fenômenos vivenciados na região."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Elabora projetos com base em dados reais de sua localidade, utilizando métodos de investigação científica para propor soluções contextualizadas e sustentáveis a problemas do cotidiano."
        }
      ],
      "exemplos": [
        "Alunos de Uberlândia elaboram um gráfico sobre a variação do clima na região e interpretam suas implicações no cotidiano.",
        "Turma de Ituiutaba desenvolve um projeto sobre o uso racional da água nas propriedades agrícolas do município.",
        "Estudantes de Patos de Minas apresentam soluções para o descarte correto de lixo em feiras livres da cidade."
      ]
    },
    {
      "dimensao": "Perfil Socioeconômico e Contextual",
      "fonte": "Adaptado de BRASIL. INEP. Indicadores contextuais do SAEB (2017).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "ESCS",
        "Rubrica SAEB"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Apresenta limitações severas de acesso e estímulo no contexto familiar e comunitário."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Vivencia condições mínimas de estrutura e apoio escolar/familiar, com participação eventual."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Apresenta estabilidade socioeconômica e utiliza recursos comunitários e escolares com autonomia."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Assume postura ativa na promoção da equidade, identidade territorial e justiça social em contextos diversos."
        }
      ],
      "exemplos": [
        "Estudantes de Araguari desenvolvem uma horta comunitária com apoio das famílias e da escola.",
        "Jovens da zona rural de Monte Alegre de Minas relatam a importância do transporte escolar para garantir frequência.",
        "Alunos de Iturama realizam visitas a museus e espaços culturais locais, integrando saberes escolares e regionais."
      ]
    },
    {
      "dimensao": "Autonomia e Autorregulação da Aprendizagem",
      "fonte": "Adaptado de BRASIL. MEC. BNCC (2017) e SAEB (2017), com apoio em Flavell (1979) sobre metacognição.",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "BNCC",
        "SAEB",
        "Neuropsicopedagogia"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Depende inteiramente de orientações externas para realizar atividades."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Realiza tarefas com ajuda parcial, demonstrando esforço para se organizar."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Planeja suas ações, avalia resultados e corrige estratégias de forma crescente."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Demonstra domínio da gestão do próprio tempo, objetivos e estratégias de aprendizagem."
        }
      ],
      "exemplos": [
        "Alunos de Frutal criam cronogramas de estudos semanais sem mediação direta de professores.",
        "Estudantes de Sacramento organizam grupos de estudo autônomos para se prepararem para a OBMEP.",
        "Turmas de Canápolis fazem autoavaliações mensais de desempenho e ajustam suas rotinas escolares."
      ]
    },
    {
      "dimensao": "Capacidade de Comunicação e Expressão",
      "fonte": "Adaptado de BRASIL. INEP. Resultados SAEB (2017) e OCDE. Relatório PISA (2022).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "SAEB",
        "PISA",
        "Rubrica de Linguagens"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Expressa-se com vocabulário restrito, apresentando dificuldades de coesão, clareza e organização textual."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Comunica ideias em contextos conhecidos com vocabulário funcional, demonstrando estrutura básica de expressão."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Organiza e expressa argumentos de forma coerente e adequada ao gênero e situação comunicativa."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Produz discursos orais e escritos com riqueza vocabular, domínio discursivo e argumentação sólida, com foco social e educativo."
        }
      ],
      "exemplos": [
        "Alunos de Itapagipe fazem podcasts sobre a história dos quilombos do Triângulo Mineiro.",
        "Estudantes de Campina Verde produzem cartas argumentativas para reivindicar melhorias na escola.",
        "Turmas de Prata apresentam seminários sobre culturas tradicionais do Alto Paranaíba."
      ]
    },
    {
      "dimensao": "Raciocínio Lógico e Solução de Problemas",
      "fonte": "Adaptado de BRASIL. INEP. SAEB (2017) e OCDE. PISA (2022).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "Rubrica SAEB",
        "Taxonomia SOLO",
        "PISA"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Aplica procedimentos simples sob mediação, com dificuldade em generalizar padrões ou inferir estratégias."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Resolve problemas estruturados com apoio, utilizando técnicas previamente ensinadas."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Aplica estratégias variadas com autonomia para resolver desafios do cotidiano escolar e comunitário."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Cria soluções originais para problemas reais, articulando dados, lógica e criatividade com base em múltiplas abordagens."
        }
      ],
      "exemplos": [
        "Alunos de Coromandel resolvem problemas matemáticos usando dados da produção de leite local.",
        "Estudantes de Patrocínio simulam cálculos para organizar a logística de uma feira de ciências.",
        "Turmas de Tupaciguara desenvolvem jogos lógicos inspirados em desafios do cotidiano da cidade."
      ]
    },
    {
      "dimensao": "Engajamento e Responsabilidade Social",
      "fonte": "Adaptado de OCDE (2022), BRASIL. INEP (2017), com apoio em autores como Paulo Freire (1996).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "SAEB",
        "PISA",
        "Freire",
        "Justiça Social"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Participa de forma limitada e reativa, com baixo envolvimento nas ações coletivas escolares."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Colabora quando solicitado, demonstrando sensibilidade inicial para ações em grupo e ética social."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Compromete-se ativamente com propostas coletivas e busca resolver conflitos de forma empática e construtiva."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Lidera ações sociais e educativas com intencionalidade transformadora e compromisso com o bem coletivo local."
        }
      ],
      "exemplos": [
        "Estudantes de Nova Ponte organizam campanha de arrecadação de agasalhos no inverno.",
        "Alunos de Conceição das Alagoas realizam mutirão para revitalizar espaços da escola.",
        "Turmas de Uberaba promovem debates sobre combate ao racismo em comunidades locais."
      ]
    },
    {
      "dimensao": "Relacionamento com Saberes Científicos e Culturais",
      "fonte": "Adaptado de BRASIL. INEP. Resultados SAEB (2017) e OCDE. Relatório PISA (2022), com apoio da BNCC (2017).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "BNCC",
        "SAEB",
        "PISA",
        "Rubrica CTC"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Participa de atividades culturais e científicas como espectador, sem articulação crítica ou aprofundamento."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Reconhece saberes tradicionais e científicos com apoio docente, valorizando a diversidade de fontes e práticas."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Relaciona de forma autônoma conhecimentos escolares com manifestações culturais e científicas locais."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Integra criticamente saberes diversos, propondo soluções e ações educativas de valorização territorial e cultural."
        }
      ],
      "exemplos": [
        "Alunos de Araxá fazem uma releitura científica das propriedades terapêuticas da lama da região.",
        "Estudantes de Lagoa Formosa elaboram projetos sobre festas religiosas como patrimônio imaterial.",
        "Turmas de Perdizes comparam técnicas de cultivo tradicionais com a agricultura de precisão."
      ]
    },
    {
      "dimensao": "Pertencimento e Equidade Territorial (CTC + EJI + ESCS)",
      "fonte": "Adaptado de BRASIL. MEC. BNCC (2017), CNE/CEB (2011), DCNs para Educação do Campo (2010) e Quilombola (2012).",
      "nota": "Adaptação realizada pelo autor deste trabalho em 2025.",
      "rubrica_origem": [
        "CTC",
        "EJI",
        "ESCS",
        "Rubrica de Justiça Social"
      ],
      "niveis": [
        {
          "nota": 1,
          "nome": "Emergente",
          "descricao": "Apresenta baixa identificação com a cultura local e ausência de reconhecimento territorial ou étnico."
        },
        {
          "nota": 2,
          "nome": "Intermediário",
          "descricao": "Demonstra respeito à diversidade, mas ainda com postura passiva frente às desigualdades."
        },
        {
          "nota": 3,
          "nome": "Proficiente",
          "descricao": "Reconhece as desigualdades históricas e atua em projetos de valorização de grupos sub-representados."
        },
        {
          "nota": 4,
          "nome": "Avançado",
          "descricao": "Assume postura ativa na promoção da equidade, identidade territorial e justiça social em contextos diversos."
        }
      ],
      "exemplos": [
        "Estudantes de comunidades quilombolas em Gurinhatã desenvolvem um projeto de mapeamento cultural da região com valorização da memória oral e patrimônio local.",
        "Jovens indígenas em São João das Missões propõem um plano de acessibilidade e representatividade no grêmio estudantil.",
        "Alunos de escolas do campo em Monte Alegre de Minas criam uma feira territorial com produtos, saberes e práticas tradicionais da agricultura familiar local."
      ]
    }
  ],
  "referencias": [
    {
      "autor": "ANDERSON, Lorin W.; KRATHWOHL, David R.",
      "ano": 2001,
      "titulo": "A taxonomy for learning, teaching, and assessing: a revision of Bloom's taxonomy of educational objectives",
      "local": "New York",
      "editora": "Longman"
    },
    {
      "autor": "BLOOM, Benjamin S.",
      "ano": 1956,
      "titulo": "Taxonomy of educational objectives: the classification of educational goals",
      "local": "New York",
      "editora": "Longmans"
    },
    {
      "autor": "BRASIL. Ministério da Educação.",
      "ano": 2017,
      "titulo": "Base Nacional Comum Curricular (BNCC)",
      "local": "Brasília",
      "editora": "MEC"
    },
    {
      "autor": "BRASIL. Instituto Nacional de Estudos e Pesquisas Educacionais Anísio Teixeira.",
      "ano": 2017,
      "titulo": "SAEB - Sistema de Avaliação da Educação Básica",
      "local": "Brasília",
      "editora": "INEP"
    },
    {
      "autor": "OCDE - Organização para a Cooperação e Desenvolvimento Econômico.",
      "ano": 2022,
      "titulo": "PISA 2022 Results (Volume I): Student Performance in Reading, Mathematics and Science",
      "local": "Paris",
      "editora": "OECD Publishing"
    },
    {
      "autor": "FLAVELL, John H.",
      "ano": 1979,
      "titulo": "Metacognition and Cognitive Monitoring: A New Area of Cognitive-Developmental Inquiry",
      "revista": "American Psychologist",
      "volume": "34",
      "paginas": "906-911"
    },
    {
      "autor": "FREIRE, Paulo",
      "ano": 1996,
      "titulo": "Pedagogia do Oprimido",
      "local": "Rio de Janeiro",
      "editora": "Paz e Terra"
    },
    {
      "autor": "BRASIL. Conselho Nacional de Educação / Câmara de Educação Básica.",
      "ano": 2011,
      "titulo": "Diretrizes Operacionais para o Ensino Médio na Perspectiva da Educação Integral",
      "local": "Brasília",
      "editora": "MEC"
    },
    {
      "autor": "BRASIL. Ministério da Educação. Secretaria de Educação Continuada, Alfabetização, Diversidade e Inclusão.",
      "ano": 2010,
      "titulo": "Diretrizes Curriculares Nacionais para a Educação do Campo",
      "local": "Brasília",
      "editora": "MEC"
    },
    {
      "autor": "BRASIL. Ministério da Educação. Secretaria de Educação Continuada, Alfabetização, Diversidade e Inclusão.",
      "ano": 2012,
      "titulo": "Diretrizes Curriculares Nacionais para a Educação Escolar Quilombola",
      "local": "Brasília",
      "editora": "MEC"
    }
  ]
}